krayon/pinball-OPP/Stm32Workbench/OppGen3/Src/Common/digital.c
/*
 * ===============================================================================
 * 
 * Name: digital_upd_sol_cfg
 * 
 * ===============================================================================
 */
/**
 * Update solenoid configuration
 *
 * Update a solenoid configuration.
 * 
 * @param   updMask - Mask of solenoids to be updated. 
 * @return  None
 * 
 * @pre     None 
 * @note    None
 * 
 * ===============================================================================
 */
void digital_upd_sol_cfg(
   U16                        updMask)
{
   INT                        index;
   INT                        currBit;
   DIG_SOL_STATE_T            *solState_p;
   RS232I_SOL_CFG_T           *solDrvCfg_p;
   DIG_INP_STATE_T            *inpState_p;
   
   /* Clear the solenoid state machines */
   updMask &= dig_info.solMask;
   for (index = 0, solState_p = &dig_info.solState[0], currBit = 1;
      index < RS232I_NUM_GEN2_SOL; index++, solState_p++, currBit <<= 1)
   {
      if ((updMask & currBit) != 0)
      {
         solState_p->solState = SOL_STATE_IDLE;
         dig_info.outputMask |= solState_p->bit;
         solDrvCfg_p = &gen2g_info.solDrvCfg_p->solCfg[index];
         if (solDrvCfg_p->cfg & USE_SWITCH)
         {
            inpState_p = &dig_info.inpState[((index & 0x0c) << 1) + (index & 0x03)];
            inpState_p->cnt = 0;

            /* Don't set input bit if solenoid 0 and NeoSol wing */
            if ((index != 0) || (gen2g_info.nvCfgInfo.wingCfg[0] != WING_NEO_SOL))
            {
               solState_p->inpBits |= (1 << (((index & 0x0c) << 1) + (index & 0x03)));
            }
         }
         else
         {
            solState_p->inpBits &= ~(1 << (((index & 0x0c) << 1) + (index & 0x03)));
         }
      }
   }
} /* End digital_upd_sol_cfg */

/*
 * ===============================================================================
 * 
 * Name: digital_upd_inp_cfg
 * 
 * ===============================================================================
 */
/**
 * Update input configuration
 *
 * Update an input configuration.
 * 
 * @param   updMask - Mask of inputs to be updated. 
 * @return  None
 * 
 * @pre     None 
 * @note    None
 * 
 * ===============================================================================
 */
void digital_upd_inp_cfg(
   U32                        updMask)
{
   INT                        index;
   INT                        currBit;
   DIG_INP_STATE_T            *inpState_p;
   RS232I_CFG_INP_TYPE_E      *inpCfg_p;
   
   /* Clear the input counts */
   for (index = 0, inpState_p = &dig_info.inpState[0],
      inpCfg_p = &gen2g_info.inpCfg_p->inpCfg[0], currBit = 1;
      index < RS232I_NUM_GEN2_INP;
      index++, inpState_p++, inpCfg_p++, currBit <<= 1)
   {
      if ((updMask & currBit) != 0)
      {
         inpState_p->cnt = 0;
         if (*inpCfg_p == STATE_INPUT)
         {
            dig_info.stateMask |= currBit;
         }
         else
         {
            dig_info.stateMask &= ~currBit;
         }
      }
   }
} /* End digital_upd_inp_cfg */

/*
 * ===============================================================================
 *
 * Name: digital_upd_outputs
 *
 * ===============================================================================
 */
/**
 * Update outputs
 *
 * Update output bits in temporary registers.
 *
 * @param   value - Value of outputs to be updated.
 * @param   mask - Mask of outputs to be updated.
 * @return  None
 *
 * @pre     None
 * @note    None
 *
 * ===============================================================================
 */
void digital_upd_outputs(
   U32                        value,
   U32                        mask)
{
   dig_info.outputUpd |= value;
   dig_info.outputMask |= mask;
} /* End digital_upd_outputs */

/*
 * ===============================================================================
 *
 * Name: digital_write_outputs
 *
 * ===============================================================================
 */
/**
 * Write outputs to pins
 *
 * Write cached output updates to pins.
 *
 * @param   None
 * @return  None
 *
 * @pre     None
 * @note    None
 *
 * ===============================================================================
 */
void digital_write_outputs()
{
   stdldigio_write_all_ports(dig_info.outputUpd, dig_info.outputMask);

   dig_info.outputUpd = 0;
   dig_info.outputMask = 0;
} /* End digital_write_outputs */
